# Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
# является ли этот день выходным
print ('Введите число N от 1 до 7 =')
N = int(input())
if N < 6:
    print ('нет')
else:
    print ('да')
